
# Taps

tap "homebrew/core"
tap "homebrew/cask"


# Machine management

brew "mas" # Mac App Store CLI: https://github.com/mas-cli/mas


# Version control

brew "git"
brew "hub" # GitHub CLI: https://hub.github.com


# Business software

cask "dropbox"
mas "1Password 7", id: 1333542190
mas "Slack", id: 803453959
mas "Trello", id: 1278508951


# Editors / IDEs

cask "atom"
cask "visual-studio-code"
cask "jetbrains-toolbox"


# Developer tools

brew "httpie" # Command-line HTTP client: https://httpie.org
cask "postman" # API development environment: https://www.getpostman.com
cask "robo-3t" # MongoDB GUI client: https://robomongo.org


# Browsers

cask "firefox"
cask "google-chrome"


# JavaScript

brew "node"
brew "nvm"
brew "yarn"


# Python

brew "python"
brew "pipenv"
brew "pyenv"


# DevOps

brew "awscli"
brew "heroku"


# Design tools

cask "sketch"
cask "zeplin"


# Virtualisation

cask "virtualbox"
cask "parallels-desktop"
cask "vmware-fusion"
